Revit 2027 API
ParameterTypeId.OrientByView Property
 "Rotate With Text"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId OrientByView { get; }
Public Shared ReadOnly Property OrientByView As ForgeTypeId
	Get
public:
static property ForgeTypeId^ OrientByView {
	ForgeTypeId^ get ();
}
static member OrientByView : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace